app/controllers/application_controller.rb

    def user
        user = User.find(session[:uid])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]