app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres"
---
    def index
        genre = Genre.all