app/controllers/users_controller.rb

    def create
      new_user = User.create!(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "profile_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def login
        found_user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "wellsfargo"], ["LIMIT", 1]]

    def update_password
        user.update!(password: params[:password])
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2023-03-29 07:20:12.224804"], ["id", 3]]